Revit 2026 API

# CableTraySizeIteratorGetCurrent Method

---

Returns the current MEPSize.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public MEPSize GetCurrent()
```
```vb
Public Function GetCurrent As MEPSize
```
```cpp
public:
MEPSize^ GetCurrent()
```
```fsharp
member GetCurrent : unit -> MEPSize
```

#### Return Value

MEPSize The current MEPSize.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | There is no current item in the iterator. |

#### Reference

CableTraySizeIterator Class

Autodesk.Revit.DB.Electrical Namespace